# Equality Operator

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkElementId..::..Equality Operator
LinkElementId Class See Also
---
Determines whether these two LinkElementIds are the same.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool operator ==(
	LinkElementId first,
	LinkElementId second
)
```

Visual Basic
---
```text
Public Shared Operator = ( _
	first As LinkElementId, _
	second As LinkElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool operator ==(
	LinkElementId^ first,
	LinkElementId^ second
)
```

# ### Parameters
first
    Type: Autodesk.Revit.DB..::..LinkElementIdThe first LinkElementId.
second
    Type: Autodesk.Revit.DB..::..LinkElementIdThe second LinkElementId.
# ### Return Value
True if the LinkElementIds are the same; otherwise, false.
# See Also
LinkElementId Class
Autodesk.Revit.DB Namespace